ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/esb_findProducts_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.ebay">
   <soapenv:Header></soapenv:Header>
   <soapenv:Body>
        <urn:apiUrl>%s(shoppingApiUrl)</urn:apiUrl>
        <urn:appId>%s(appId)</urn:appId>
        <urn:siteId>%s(siteId)</urn:siteId>
        <urn:version>829</urn:version>
        <urn:method>findProducts</urn:method>
    </soapenv:Body>
</soapenv:Envelope>